run/capillaryBreakup/galinstan/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "./caseConditions"

scale   1;//$diameter; // drop diameter
size	0.5e-2;

vertices
(
    (-$size -$size -$size)
    ($size -$size -$size)
    ($size $size -$size)
    (-$size $size -$size)
    (-$size -$size $size)
    ($size -$size $size)
    ($size $size $size)
    (-$size $size $size)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    symmetryBC
    {
        type symmetry;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)
            (1 5 4 0)
            (0 3 2 1)
        );
    }

   outflowBC
   {
        type patch;
        faces
        (
            (4 5 6 7)
            (3 7 6 2)
        );
   }
);

mergePatchPairs
(
);

// ************************************************************************* //
