run/capillaryBreakup/galinstan/constant/thermophysicalProperties.galinstan
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./caseConditions"

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectFluid;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   $MWMelt;
    }
    equationOfState
    {
        R           $RMelt;
        rho0        6440;
    }
    thermodynamics
    {
        Cp          $CpMelt;
        Hf          $HfMelt;
    }
    transport
    {
        mu          2.4e-3;
        Pr          $PrMelt;
    }
}


// ************************************************************************* //
