run/capillaryBreakup/galinstan/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication setAlphaField

runApplication decomposePar
runParallel $(getApplication)

runApplication reconstructParMesh
runApplication reconstructPar

foamSequenceVTKFiles -vtp
#------------------------------------------------------------------------------
